# Preparing csv data to visualize in Tableau

Importing Modules

In [19]:
import pandas as pd

### Reading in my first csv file, the avocado prices

In [3]:
avo_df = pd.read_csv('avocado.csv', usecols = ['Date', 'AveragePrice', 'year', 'region'])

avo_df.head()

         Date  AveragePrice  year  region
0  2015-12-27          1.33  2015  Albany
1  2015-12-20          1.35  2015  Albany
2  2015-12-13          0.93  2015  Albany
3  2015-12-06          1.08  2015  Albany
4  2015-11-29          1.28  2015  Albany

Filtering the data to only include that of the Atlanta region

In [4]:
avo_df = avo_df.loc[avo_df.region == 'Atlanta']

avo_df.head()

          Date  AveragePrice  year   region
52  2015-12-27          0.99  2015  Atlanta
53  2015-12-20          1.08  2015  Atlanta
54  2015-12-13          0.96  2015  Atlanta
55  2015-12-06          1.07  2015  Atlanta
56  2015-11-29          0.99  2015  Atlanta

Checking basic info, such as shape, NaNs, and dtypes

In [5]:
avo_df.shape

(338, 4)

In [6]:
avo_df.isnull().values.any()

False

In [7]:
avo_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 338 entries, 52 to 17624
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          338 non-null    object
 1   AveragePrice  338 non-null    float64
 2   year          338 non-null    int64
 3   region        338 non-null    object
dtypes: float64(1), int64(1), object(2)
memory usage: 13.2+ KB

Changing "year" to a string so I can use .loc on it later

In [8]:
avo_df['year'] = avo_df['year'].astype(str)

In [9]:
avo_df.describe()

       AveragePrice
count    338.000000
mean       1.337959
std        0.398297
min        0.620000
25%        1.040000
50%        1.230000
75%        1.620000
max        2.750000

Using .loc to separate out and find the mean of each chunk of data by year, then using the results to make a new dataframe of just averages

In [21]:
avo_2015 = avo_df.loc[avo_df.year == '2015']
avo_2016 = avo_df.loc[avo_df.year == '2016']
avo_2017 = avo_df.loc[avo_df.year == '2017']
avo_2018 = avo_df.loc[avo_df.year == '2018']

print(avo_2015.AveragePrice.mean())
print(avo_2016.AveragePrice.mean())
print(avo_2017.AveragePrice.mean())
print(avo_2018.AveragePrice.mean())

1.3805769230769231
1.2141346153846153
1.4287735849056606
1.28875

In [11]:
avo_data = {
    'year' : ['2015', '2016', '2017', '2018'],
    'avg_price' : [1.38, 1.21, 1.43, 1.29]
 }

avo_yearly_avg = pd.DataFrame(avo_data)

avo_yearly_avg

   year  avg_price
0  2015       1.38
1  2016       1.21
2  2017       1.43
3  2018       1.29

Saving both dataframes to their own excel workbooks for Tableau visualization later

In [18]:
avo_df.to_excel(excel_writer = 'avocado_years.xlsx', sheet_name = '2015-2018', index = False)

C:\Users\Katerade\AppData\Local\Temp\ipykernel_13452\1230656265.py:6: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  xlwriter.save()

In [17]:
avo_yearly_avg.to_excel(excel_writer = 'avo_yearly_avg.xlsx', sheet_name = 'years', index = False)

### Reading in the four gentrification datasets

In [ ]:
df_15 = pd.read_csv('unmerged-census-data/2015-atlanta-census.csv', header=0, names=['group', '2015'])
df_16 = pd.read_csv('unmerged-census-data/2016-atlanta-census.csv', header=0, names=['group', '2016'])
df_17 = pd.read_csv('unmerged-census-data/2017-atlanta-census.csv', header=0, names=['group', '2017'])
df_18 = pd.read_csv('unmerged-census-data/2018-atlanta-census.csv', header=0, names=['group', '2018'])

Using pd.merge to join all four dataframes into one

In [ ]:
cens_df = pd.merge(df_15, df_16['2016'], left_index=True, right_index=True, how = 'left')
cens_df = pd.merge(cens_df, df_17['2017'], left_index=True, right_index=True, how = 'left')
cens_df = pd.merge(cens_df, df_18['2018'], left_index=True, right_index=True, how = 'left')

cens_df['2015'] = cens_df['2015'].str.replace(',', '').astype(int)
cens_df['2016'] = cens_df['2016'].str.replace(',', '').astype(int)
cens_df['2017'] = cens_df['2017'].str.replace(',', '').astype(int)
cens_df['2018'] = cens_df['2018'].str.replace(',', '').astype(int)

cens_df

,group,2015,2016,2017,2018
0,Total:,463875,472506,486299,498073
1,Not Hispanic or Latino:,445222,449408,465421,475094
2,White alone,176998,178077,179296,189230
3,Black or African American alone,239159,237590,253556,252493
4,American Indian and Alaska Native alone,652,951,374,495
5,Asian alone,20335,20253,19551,19875
6,Native Hawaiian and Other Pacific Isla...,147,170,0,142
7,Some other race alone,265,481,2129,1324
8,Two or more races:,7666,11886,10515,11535
9,Two races including Some other race,405,1236,144,471
10,Two races excluding Some other rac...,7261,10650,10371,11064
11,Hispanic or Latino:,18653,23098,20878,22979
12,White alone,12155,12815,11119,14285
13,Black or African American alone,1440,2612,3332,1277
14,American Indian and Alaska Native alone,651,1944,330,323
15,Asian alone,81,197,0,144
16,Native Hawaiian and Other Pacific Isla...,316,39,0,0
17,Some other race alone,2282,3482,4409,5214
18,Two or more races:,1728,2009,1688,1736
19,Two races including Some other race,529,578,766,571
20,Two races excluding Some other rac...,1199,1431,922,1165

Tediously going through and renaming each value in the "group" column to separate it from it's counterpart

In [ ]:
cens_df.loc[12:12, ['group']] = ['h_white_alone']
cens_df.loc[13:13, ['group']] = ['h_black_or_african-american']
cens_df.loc[14:14, ['group']] = ['h_american_indian_and_alaska_native']
cens_df.loc[15:15, ['group']] = ['h_asian']
cens_df.loc[16:16, ['group']] = ['h_native_hawaiian_pacific_islander']
cens_df.loc[17:17, ['group']] = ['h_other']
cens_df.loc[18:18, ['group']] = ['h_two_or_more_races_total']
cens_df.loc[19:19, ['group']] = ['h_two_races_including_some_other_race']
cens_df.loc[20:20, ['group']] = ['h_two_races_excluing_some_other_race']

cens_df

,group,2015,2016,2017,2018
0,Total:,463875,472506,486299,498073
1,Not Hispanic or Latino:,445222,449408,465421,475094
2,White alone,176998,178077,179296,189230
3,Black or African American alone,239159,237590,253556,252493
4,American Indian and Alaska Native alone,652,951,374,495
5,Asian alone,20335,20253,19551,19875
6,Native Hawaiian and Other Pacific Isla...,147,170,0,142
7,Some other race alone,265,481,2129,1324
8,Two or more races:,7666,11886,10515,11535
9,Two races including Some other race,405,1236,144,471
10,Two races excluding Some other rac...,7261,10650,10371,11064
11,Hispanic or Latino:,18653,23098,20878,22979
12,h_white_alone,12155,12815,11119,14285
13,h_black_or_african-american,1440,2612,3332,1277
14,h_american_indian_and_alaska_native,651,1944,330,323
15,h_asian,81,197,0,144
16,h_native_hawaiian_pacific_islander,316,39,0,0
17,h_other,2282,3482,4409,5214
18,h_two_or_more_races_total,1728,2009,1688,1736
19,h_two_races_including_some_other_race,529,578,766,571
20,h_two_races_excluing_some_other_race,1199,1431,922,1165

Pivoting the dataframe to wide for ease of visualization later

In [ ]:
years = ['2015', '2016', '2017', '2018']

# piv_cens = cens_df.pivot_table(columns = 'group', index = years)

piv_cens = pd.pivot_table(data = cens_df, values =['2015', '2016', '2017', '2018'], columns="group")

piv_cens

group,Total:,h_american_indian_and_alaska_native,h_asian,h_black_or_african-american,h_native_hawaiian_pacific_islander,h_other,h_two_or_more_races_total,h_two_races_excluing_some_other_race,h_two_races_including_some_other_race,h_white_alone,...,Not Hispanic or Latino:,American Indian and Alaska Native alone,Asian alone,Black or African American alone,Native Hawaiian and Other Pacific Islander alone,Some other race alone,Two or more races:,White alone,"Two races excluding Some other race, and three or more races",Two races including Some other race
2015,463875,651,81,1440,316,2282,1728,1199,529,12155,...,445222,652,20335,239159,147,265,7666,176998,7261,405
2016,472506,1944,197,2612,39,3482,2009,1431,578,12815,...,449408,951,20253,237590,170,481,11886,178077,10650,1236
2017,486299,330,0,3332,0,4409,1688,922,766,11119,...,465421,374,19551,253556,0,2129,10515,179296,10371,144
2018,498073,323,144,1277,0,5214,1736,1165,571,14285,...,475094,495,19875,252493,142,1324,11535,189230,11064,471

Saving both dataframes at Excel files

In [ ]:
cens_df.to_excel(excel_writer= 'atlanta-census.xlsx' , sheet_name='2015-2018')

In [ ]:
piv_cens.to_excel(excel_writer= 'piv_atlanta-census.xlsx', sheet_name= '2015-2018')